{
  "plugins": {
    "blink.cmp": {
      "src": "https://github.com/saghen/blink.cmp",
      "version": "'bda905a4bf1b3edfa708b0be193b8c63d8620c96'"
    },
    "blink.lib": {
      "src": "https://github.com/saghen/blink.lib",
      "version": "'5876dd95deeb70aadbe9f1c0b7117a135061cdac'"
    },
    "conform.nvim": {
      "src": "https://github.com/stevearc/conform.nvim",
      "version": "'619363c30309d29ffa631e67c8183f2a72caa373'"
    },
    "fidget.nvim": {
      "src": "https://github.com/j-hui/fidget.nvim",
      "version": "'6f793b2bcd2d35e201c09520f698bb763220908a'"
    },
    "friendly-snippets": {
      "src": "https://github.com/rafamadriz/friendly-snippets",
      "version": "'6cd7280adead7f586db6fccbd15d2cac7e2188b9'"
    },
    "fzf-lua": {
      "src": "https://github.com/ibhagwan/fzf-lua",
      "version": "'b9919229c84bd64d8539367e67e32811cf39a836'"
    },
    "fzf-lua-lazy.nvim": {
      "src": "https://github.com/roginfarrer/fzf-lua-lazy.nvim",
      "version": "'e813f5df261ff5b781204c108af8f071bf0e1b00'"
    },
    "mason.nvim": {
      "src": "https://github.com/mason-org/mason.nvim",
      "version": "'2a6940af80375532e5e9e7c1f2fc6319a1b7a69d'"
    },
    "mini.diff": {
      "src": "https://github.com/echasnovski/mini.diff",
      "version": "'0743d26bd858ebe32efcf5c86a91a422a000f273'"
    },
    "mini.hipatterns": {
      "src": "https://github.com/nvim-mini/mini.hipatterns",
      "version": "'607d604e650cdf21d71f863d040c496a1d0cb320'"
    },
    "mini.icons": {
      "src": "https://github.com/nvim-mini/mini.icons",
      "version": "'e56797f90192d81f1fda02e662fc3e8e3d775027'"
    },
    "neotab.nvim": {
      "src": "https://github.com/kawre/neotab.nvim",
      "version": "'e99d3e28c5a2066d2d368dfe4ef3827c8d75d337'"
    },
    "nvim-autopairs": {
      "src": "https://github.com/windwp/nvim-autopairs",
      "version": "'7b9923abad60b903ece7c52940e1321d39eccc79'"
    },
    "nvim-treesitter": {
      "src": "https://github.com/nvim-treesitter/nvim-treesitter"
    },
    "tokyonight.nvim": {
      "src": "https://github.com/folke/tokyonight.nvim",
      "version": "'cdc07ac78467a233fd62c493de29a17e0cf2b2b6'"
    },
    "tree-sitter-manager.nvim": {
      "src": "https://github.com/romus204/tree-sitter-manager.nvim"
    },
    "trouble.nvim": {
      "src": "https://github.com/folke/trouble.nvim",
      "version": "'bd67efe408d4816e25e8491cc5ad4088e708a69a'"
    },
    "vim-tmux-navigator": {
      "src": "https://github.com/christoomey/vim-tmux-navigator",
      "version": "'e41c431a0c7b7388ae7ba341f01a0d217eb3a432'"
    },
    "which-key.nvim": {
      "src": "https://github.com/folke/which-key.nvim",
      "version": "'3aab2147e74890957785941f0c1ad87d0a44c15a'"
    }
  }
}
