jorgebucaran/fisher
wfxr/forgit
oh-my-fish/plugin-bang-bang
oh-my-fish/plugin-wttr
catppuccin/fish
qiuxiang/flutter-fish-completions
adriaanzon/fish-artisan-completion
nickeb96/puffer-fish
gazorby/fifc
